################################################
#
# Чтение параметров обмена
#
# Код команды:	15h. Длина сообщения: 6 байт.
# Пароль системного администратора (4 байта)
# Номер порта (1 байт) 0…2551

# Ответ: 15h. Длина сообщения: 4 байта.
#   Код ошибки (1 байт)
#   Код скорости обмена (1 байт) 0…91,2 или номер TCP порта3 (1 байт) 0…255
#   Тайм аут приема байта4,5 (1 байт) 0…255
#
################################################
#
#  Команда доступна в любом состоянии
#  Команда не меняет состояние ФР
#
################################################

name: "Команда 15h"
description: "Чтение параметров обмена"

tests:
  - name: "Команда 15 - неверная длина команды"
    testtype: command
    command: "15"
    resultcode: 126
    
  - name: "Команда 15 - неверная длина команды 2"
    testtype: command
    command: "15 1E 00 00 00"
    resultcode: 126

  - name: "Команда 15 - неверная длина команды 2"
    testtype: command
    command: "15 1E 00 00 00"
    resultcode: 126

  - name: "Команда 15 - неверный пароль"
    testtype: command
    command: "15 FF FF FF FF"
    resultcode: 126
    
  - name: "Команда 15 - номер порта 0"
    testtype: command
    command: "15 1E 00 00 00 00"
    response: "15 00 06 9D"
    resultcode: 0
    
  - name: "Команда 15 - номер порта 1"
    testtype: command
    command: "15 1E 00 00 00 01"
    response: "15 00 06 9D"
    resultcode: 0
    
  - name: "Команда 15 - код порта 0xFF"
    testtype: command
    command: "15 1E 00 00 00 FF"
    response: "15 00 06 9D"
    resultcode: 0
    
