################################################
#
#  Печать заголовка документа
#  
#  Код команды:	18h. Длина сообщения: 37 байт.
#    Пароль оператора (4 байта)
#    Наименование документа1,2 (30 байт)
#    Номер документа (2 байта)
#  
#  Ответ:		18h. Длина сообщения: 5 байт.
#    Код ошибки (1 байт)
#    Порядковый номер оператора (1 байт) 1…30
#    Сквозной номер документа (2 байта)
#
################################################
#
#  Команда доступна в состояниях:
#  2. Открытая смена, 24 часа не кончились
#  3. Открытая смена, 24 часа кончились
#  4. Закрытая смена
#  8. Открытый документ
#
#  Команда недоступна в состояниях:
#  1. Выдача данных
#  6. Ожидание подтверждения ввода даты
# 
#  Команда не меняет состояние ФР
#
################################################

name: "Команда 18h"
description: "Печать заголовка документа"

tests:
  - name: "Команда: 18, длина команды 1, ошибка 126"
    testtype: command
    command: "18"
    resultcode: 126    
    
  - name: "Команда: 18, длина команды 37, ошибка 126"
    testtype: command
    command: "18 1E 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 01 00"
    resultcode: 126    
    
  - name: "Команда: 18, номер документа 0, ошибка 51"
    testtype: command
    command: "18 1E 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00"
    resultcode: 51    
    
  - name: "Команда: 18, номер документа 0xFFFF, ошибка 51"
    testtype: command
    command: "18 1E 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 FF FF"
    resultcode: 51    
    
  - name: "Команда: 18, номер документа 0x7530, ошибка 51"
    testtype: command
    command: "18 1E 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 75 30"
    resultcode: 51    
    
  - name: "Команда 18, данные все нули, ошибок нет"
    testtype: command
    command: "18 1E 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 01"
    response: "18 00 1E"
    resultcode: 00
    
  - name: "Команда 18, номер документа 9999, ошибок нет"
    testtype: command
    command: "18 1E 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 0F 27"
    response: "18 00 1E"
    resultcode: 00
    
  - name: "Команда 18, номер документа 10000, ошибок нет"
    testtype: command
    command: "18 1E 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 10 27"
    response: "18 00 1E"
    resultcode: 51
    
  - name: "Команда 18, номер документа 10001, ошибок нет"
    testtype: command
    command: "18 1E 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 11 27"
    response: "18 00 1E"
    resultcode: 51
    
  - name: "Команда 18, данные все 0xFF, ошибок нет"
    testtype: command
    command: "18 1E 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 01"
    command: "18 1E 00 00 00 FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF 01"
    response: "18 00 1E"
    resultcode: 00
    
