################################################
# Запрос дампа
#
# Код команды:	01h. Длина сообщения: 6 байт.
# Пароль сервисной организации 1 или системного администратора1, 
# если пароль сервисной организации не был установлен (4 байта).
#
# Код устройства1 (1 байт):
#   03h – часы
#   04h – энергонезависимая память
#   06h – память программ ККТ
#   07h – оперативная память ККТ
#   08h – образ файловой системы
#   09h – образ uLinux
#   0Ah – исполняемый файл ПО
#   86h2 – память программ ККТ
# Ответ: 		01h. Длина сообщения: 4 байта.
#   Код ошибки (1 байт)
#   Количество блоков данных (2 байта)
#
################################################
#
#  Команда подается в состояниях:
#  2, Открытая смена 
#  4, Закрытая смена
#
#  После команды ФР переходит в состояние
#  1, Выдача данных
#
################################################

name: "Команда 01h"
description: "Запрос дампа"

tests:
  - name: "Корректный код устройства 6"
    command: "01 00 00 00 00 06"
    response: "01 00 00 XX"
    ecrmode_before: 4
    ecrmode_after: 1
    
  - name: "Корректный код устройства 7"
    command: "01 00 00 00 00 07"
    response: "01 00 00 XX"
    ecrmode_before: 4
    ecrmode_after: 1
    
  - name: "Команда поддерживается в состоянии 2, Открытая смена"
    command: "01 00 00 00 00 06"
    response: "01 00 00 XX"
    ecrmode_before: 2
    ecrmode_after: 1
    
  - name: "Команда поддерживается в состоянии 6, confirmDate"
    command: "01 00 00 00 00 06"
    response: "01 00 00 XX"
    ecrmode_before: 6
    ecrmode_after: 1
    
  - name: "Команда не поддерживается в состоянии 1, Выдача данных"
    command: "01 00 00 00 00 06"
    ecrmode_before: 1
    ecrmode_after: 1
    resultcode: 115
    
  - name: "Команда не поддерживается в состоянии 8, openrec"
    command: "01 00 00 00 00 06"
    ecrmode_before: 8
    ecrmode_after: 8
    resultcode: 115
    
  - name: "Команда не поддерживается в состоянии 10, test"
    command: "01 00 00 00 00 06"
    ecrmode_before: 10
    ecrmode_after: 10
    resultcode: 115
    
  - name: "Неверный код устройства 00"
    command: "01 00 00 00 00 00"
    ecrmode_before: 4
    resultcode: 51
    
  - name: "Неверный код устройства 01"
    command: "01 00 00 00 00 01"
    resultcode: 51
    
  - name: "Неверный код устройства 02"
    command: "01 00 00 00 00 02"
    resultcode: 51
    
  - name: "Неверный код устройства 03"
    command: "01 00 00 00 00 03"
    resultcode: 51
    
  - name: "Неверный код устройства 04"
    command: "01 00 00 00 00 04"
    resultcode: 51
    
  - name: "Неверный код устройства 05"
    command: "01 00 00 00 00 05"
    resultcode: 51

  - name: "Неверный код устройства 08"
    command: "01 00 00 00 00 08"
    resultcode: 51
    
  - name: "Неверный код устройства 09"
    command: "01 00 00 00 00 09"
    resultcode: 51
    
  - name: "Неверный код устройства 0A"
    command: "01 00 00 00 00 0A"
    resultcode: 51
    
  - name: "Неверный код устройства 86"
    command: "01 00 00 00 00 86"
    resultcode: 51
    
  - name: "Неверная длина команды"
    command: "01"
    resultcode: 126

  - name: "Неверная длина команды 2"
    command: "01 1E"
    resultcode: 126
   
  - name: "Неверная длина команды 3"
    command: "01 1E 00 00 00 FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF"
    resultcode: 126
    
  - name: "Неверный пароль"
    command: "01 FF FF FF FF 03"
    resultcode: 79
