################################################
#
#   Печать жирной строки (шрифт 2) 
#       Код команды:	12h. Длина сообщения: 26 или 6+X1,2 байт.
#       Пароль оператора (4 байта)
#       Флаги (1 байт)
#           Бит 0 – контрольная лента
#           Бит 1 – чековая лента
#           Бит 2 – подкладной документ
#           Бит 3 – слип-чек
#           Бит 6 – перенос строк5
#           Бит 71 – отложенная печать
#Печатаемые символы6,7,8,9,10 (20 или X1,2 байт)
#Ответ:		12h. Длина сообщения: 3 байта.
#Код ошибки (1 байт)
#Порядковый номер оператора (1 байт) 1…30
#
################################################
#
#  Команда подается в состояниях:
#  2, Открытая смена 
#  4, Закрытая смена
#
#  После команды ФР переходит в состояние
#  1, Выдача данных
#
################################################

name: "Команда 01h"
description: "Запрос дампа"

tests:
  - name: "Корректный код устройства 6"
    testtype: command
    command: "01 00 00 00 00 06"
    response: "01 00 00 3C"
    ecrmode_before: 4
    ecrmode_after: 1
    
  - name: "Корректный код устройства 7"
    testtype: command
    command: "01 00 00 00 00 07"
    response: "01 00 00 3C"
    ecrmode_before: 4
    ecrmode_after: 1
    
  - name: "Команда поддерживается в состоянии 2, Открытая смена"
    testtype: command
    command: "01 00 00 00 00 06"
    response: "01 00 00 3C"
    ecrmode_before: 2
    ecrmode_after: 1
    
  - name: "Команда поддерживается в состоянии 6, confirmDate"
    testtype: command
    command: "01 00 00 00 00 06"
    response: "01 00 00 3C"
    ecrmode_before: 6
    ecrmode_after: 1
    
  - name: "Команда не поддерживается в состоянии 1, Выдача данных"
    testtype: command
    command: "01 00 00 00 00 06"
    ecrmode_before: 1
    ecrmode_after: 1
    resultcode: 115
    
  - name: "Команда не поддерживается в состоянии 8, openrec"
    testtype: command
    command: "01 00 00 00 00 06"
    ecrmode_before: 8
    ecrmode_after: 1
    resultcode: 115
    
  - name: "Команда не поддерживается в состоянии 10, test"
    testtype: command
    command: "01 00 00 00 00 06"
    ecrmode_before: 10
    ecrmode_after: 1
    resultcode: 115
    
  - name: "Неверный код устройства 00"
    testtype: command
    command: "01 00 00 00 00 00"
    resultcode: 51
    
  - name: "Неверный код устройства 01"
    testtype: command
    command: "01 00 00 00 00 01"
    resultcode: 51
    
  - name: "Неверный код устройства 02"
    testtype: command
    command: "01 00 00 00 00 02"
    resultcode: 51
    
  - name: "Неверный код устройства 03"
    testtype: command
    command: "01 00 00 00 00 03"
    resultcode: 51
    
  - name: "Неверный код устройства 04"
    testtype: command
    command: "01 00 00 00 00 04"
    resultcode: 51
    
  - name: "Неверный код устройства 05"
    testtype: command
    command: "01 00 00 00 00 05"
    resultcode: 51

  - name: "Неверный код устройства 08"
    testtype: command
    command: "01 00 00 00 00 08"
    resultcode: 51
    
  - name: "Неверный код устройства 09"
    testtype: command
    command: "01 00 00 00 00 09"
    resultcode: 51
    
  - name: "Неверный код устройства 0A"
    testtype: command
    command: "01 00 00 00 00 0A"
    resultcode: 51
    
  - name: "Неверный код устройства 86"
    testtype: command
    command: "01 00 00 00 00 86"
    resultcode: 51
    
  - name: "Неверная длина команды"
    testtype: command
    command: "01"
    resultcode: 126

  - name: "Неверная длина команды 2"
    testtype: command
    command: "01 1E"
    resultcode: 126
   
  - name: "Неверная длина команды 3"
    testtype: command
    command: "01 1E 00 00 00 FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF FF"
    resultcode: 126
    
  - name: "Неверный пароль"
    testtype: command
    command: "01 FF FF FF FF 03"
    resultcode: 79
